In [1]:
people = {
    "first": ["Har", 'Jonny', 'Amit', 'Naina'], 
    "last": ["Mesh", 'Harode', 'Shukla', 'Sharma'], 
    "email": ["harmesh@gmail.com", 'jonnyharode@email.com', 'amitshukla@email.com', 'Nainasharma@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                  email
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com
2   Amit  Shukla   amitshukla@email.com
3  Naina  Sharma  Nainasharma@gmail.com